---
kind: type
id: T:Autodesk.Revit.DB.WorksetKindFilter
source: html/6f41ced5-3c40-950b-294d-af027ab20870.htm
---
# Autodesk.Revit.DB.WorksetKindFilter

A filter used to match worksets of the given WorksetKind.

## Syntax (C#)
```csharp
public class WorksetKindFilter : WorksetFilter
```

## Remarks
This filter is a quick filter.